{"pageProps":{"__lang":"en","__namespaces":{"common":{"SITE":{"TITLE":"Blackhole Finance","DESCRIPTION":"Blackhole is an automatic liquidity-management protocol with sophisticated hedging strategies for Uniswap v3 that enables any investor to generate revenues in DEX."},"MENU":{"PRODUCTS":"Products","DOCUMENTATION":"Documentation","ANALYSIS":"Analysis","CONTACT":"Contact","STRATEGY_VAULTS":"Strategy Vaults","VAULTS":"Vaults","LPDFI":"LPDfi","DOCS":"Docs","ANALYTICS":"Analytics","SPACESHIP":"Spaceship"},"FOOTER":{"ABOUT":{"HEADING":"About","LINK1":"Home","LINK2":"Docs","LINK3":"Audit"},"SOCIAL":{"HEADING":"Social","LINK1":"Github","LINK2":"Twitter","LINK3":"Mirror","LINK4":"Discord"}},"WIDGET":{"TABS":{"DEPOSIT":"Deposit","WITHDRAW":"Withdraw"},"ACTION":{"DEPOSIT":"Deposit","WITHDRAW":"Withdraw","CONNECT":"Connect","SWITCH_NETWORK":"Switch Networks","SIMULATE":"Check receiving assets","CLAIM":"Claim","CLAIMED":"Claimed","MIGRATE":"Migrate"},"ERROR":{"ALLOWANCE_NOT_ENOUGH":"Allowance is not enough"}},"MODAL":{"ACCOUNT":{"TITLE":"Account","DISCONNECT":"Disconnect","COPY_ADDRESS":"Copy address","VIEW_EXPLORER":"View explorer","TRANSACTIONS":"Transactions","CLEAR_ALL":"Clear all"},"TX":{"VIEW_EXPLORER":"View on explorer","DEPOSIT_CAUTION_MESSAGE":"Excess amount will be returned to your wallet."},"SWITCH_NETWORK":{"TITLE":"Switch Networks","DESC":"Wrong network detected, switch or disconnect to continue."},"INVALID_ADDRESS":{"TITLE":"Invalid Address","DESC":"Unfortunately, the address you have used is not on the allowlist. Please check your wallet provider to ensure that you are using the right address.\nIf you believe this is a mistake, please <link>contact us</link>."}},"WALLET":{"CONNECT_WALLET":"Connect wallet","LOGIN":"Login"},"MODEL":{"VAULT":{"TOTAL_DEPOSIT":"Total Deposits","MAX_CAPACITY":"Max capacity","TOTAL_VALUE_LOCKED":"Total Value Locked"},"MIGRATION":{"TITLE":"Migrate position"},"USER":{"YOUR_POSITION":"Your position","MAX_INDIVIDUAL_CAPACITY":"Maximum deposit capacity {{capacity}} {{unit}}","YOUR_PREMIUM":"Your earned","YOUR_USDC_BALANCE":"wallet balance","BALANCE":"Balance"},"DEPOSIT":{"AMOUNT":"Amount","AMOUNT_WITH_UNIT":"Amount ({{unit}})"},"WITHDRAW":{"LP_TOKEN_RATE":"Withdraw","ESTIMATED_AMOUNT":"Estimated withdrawal amount","LOCK_CAUTION":"You need to wait {{lockPeriod}} days before making a withdraw. Deposit available for withdraw: {{until}}","WITHDRAW_ONLY":"This vault is in withdraw-only mode. Details can be found <0>here</0>.","SIMULATION":{"ASSETS":"Total Withdrawable Assets","LP_POSITIONS":"Utilized LP Positions","PRICE":"Strike Price","SIZE":"Size"}},"APR_STATS":{"HINTS":{"TOTAL_APR":"The Total APR comprises both the Reward APR and the Fee APR.","REWARD_APR":"Reward APR comes from token distributed by protocols as incentives.","FEE_APR":"Fee APR is based on the fees collected daily from the underlying pool, \nsuch as trading fees and option premiums."}},"LEADERBOARD":{"TITLE":"Leaderboard"},"CLAIM":{"TITLE":"Your rewards","RANK":"Your Rank","MILESTONE1":"${{target}} Milestone bonus (25K ARB to Top 50)","MILESTONE2":"${{target}} Milestone bonus (12.5K ARB to  All)","TOTAL":"Total"}},"DOCS":{"OVERVIEW":{"TITLE":"Overview","DESC":"USDC.e deposited into Blackhole ETH-USDC.e vault is used to provide liquidity to Uniswap v3’s ETH-USDC.e pool (0.05% fee tier). The vault maximizes Uniswap v3’s capital efficiency by employing statistical modeling and dynamically hedging delta to maintain a narrow and optimal price range."},"PERFORMANCE":{"TITLE":"Performance","APR":{"HEADING":"APR","INFO":"Calculated by getting the average of the past annualized performance."},"RECENT_PERFORMANCE":{"HEADING":"Recent Performance","INFO":"The USDC.e based performance of the vault since the last snapshot taken."}},"FEATURES":{"1":{"TITLE":"DELTA HEDGE","DESC":"Providing liquidity on a DEX without hedging is a bullish bet that exposes liquidity providers to losses when the price of the provided asset goes down. However, with our hedge control strategy, we analyze the market trend based on a 3-day moving average and adjust our hedge position accordingly.","DETAIL":"Providing liquidity on a DEX without hedging is a bullish bet that exposes liquidity providers to losses when the price of the provided asset goes down. However, with our hedge control strategy, we analyze the market trend based on a 3-day moving average and adjust our hedge position accordingly.\n\nDelta hedging on Blackhole Finance is powered by Aave, a lending protocol. A portion of deposited USDC.e is collateralized on Aave, and ETH is borrowed from them. As the ETH position is borrowed, even if the ETH price decreases, the vault can hedge a portion of losses compared to an unhedged position.\n\nSince price drops can often be sudden and steep, hedging downside risks helps to maintain portfolio value in the long run. Additionally, we reduce our hedge position with the hedge control strategy when the market is bullish, allowing for potential upside profit opportunities."},"2":{"TITLE":"WITHOUT HEDGE","CHART_NAME":"VULNERABLE ON DOWNWARD PRICE MOVEMENT"},"3":{"TITLE":"WITH HEDGE","CHART_NAME":"MITIGATE LOSSES CAUSED BY PRICE MOVEMENT"},"4":{"TITLE":"SMART LIQUIDITY","DESC":"Smart Liquidity determines the price range for providing liquidity on behalf of liquidity providers. In order to take advantage of the capital efficiency offered by Uni v3, the vault aggressively sets the price range using a delta hedging strategy that mitigates the impact of price volatility.","DETAIL":"Smart Liquidity determines the price range for providing liquidity on behalf of liquidity providers. In order to take advantage of the capital efficiency offered by Uni v3, the vault aggressively sets the price range using a delta hedging strategy that mitigates the impact of price volatility.\n\nThe price range is set by simulating volatility with statistical and financial models and parameters.\n\nIn the alpha product, we refer to Bollinger Bands and 3DMA.\nAfter referring to simulated volatility, Smart Liquidity will set optimal range settings for a liquidity pair that enables you to benefit from the highest capital efficiency.\n\nThere will be two range settings. One is range settings for liquidity provision, the other is range settings to execute stop loss. To reduce unnecessary stop loss or rebalances, two-layered range settings aim to stabilize the vault’s performance."},"5":{"TITLE":"WHEN VOLATILITY IS LOW","CHART_NAME":"KEEP LIQUIDITY CONCENTRATED AND EARN FEES"},"6":{"TITLE":"WHEN VOLATILITY IS HIGH","CHART_NAME":"WIDEN LIQUIDITY POSITION BUT STILL EARN FEES WITH A HIGH TIER"},"7":{"TITLE":"AUTO REBALANCING","DESC":"When the asset price goes out of settings, the deployed liquidity no longer earns trading fees from the Uni v3 pool. In such a case, the vault rebalances to set new ranges and start earning again.","DETAIL":"When the asset price goes out of settings, the deployed liquidity no longer earns trading fees from the Uni v3 pool. In such a case, the vault rebalances to set new ranges and start earning again.\n\nA Rebalancing strategy will be implemented when the price of assets goes out of the set range as a Stop-loss. Since liquidity is converted to either USDC.e or ETH as a result of price movement, we liquidate the position and swap a half of the liquidity to USDC.e again and re-deposit liquidity with a new range simulated by the statistical approach.\n\nFurthermore, we check all the parameters once a week, even if price still stays within the set range, to update protocol’s rebalancing strategy based on the market situation.\n\nIn the alpha product, only stop loss actions will be executed automatically. After a stop loss is executed, the quant team observes the market situation and rebalances the ranges.\n\nThe strategy includes a comparison of expected returns from fees and potential loss caused by rebalancing. Based on the trading volume and the share within the pool, we continue providing liquidity only if returns are expected to be larger than a potential loss, otherwise we liquidate a position and keep assets till the strategy becomes profitable again."},"8":{"TITLE":"RANGE ADJUSTMENT","CHART_NAME":"REBALANCE RANGE SETTINGS WHEN PRICE MOVES BEYOND A THRESHOLD"},"9":{"TITLE":"WEEKLY PARAMETER UPDATES","CHART_NAME":"UPDATE SETTINGS WEEKLY BASED ON MARKET CONDITIONS"},"TITLE":"Features"},"HOW_IT_WORKS":{"TITLE":"How it works","DEPOSIT":{"HEADING":"Deposit","LIST":[{"KEY":"Deposit USDC.e into the Blackhole ETH-USDC.e vault."},{"KEY":"A part of the deposit will be supplied to a lending protocol to make a short position for ETH."},{"KEY":"A liquidity pair is created and deployed to an ETH-USDC.e pool on Uniswap V3."},{"KEY":"Your funds could appreciate over time as the Blackhole ETH-USDC.e accrue fees."}],"STRYKE":[{"KEY":"Approve & Deposit the base asset defined by the vault."},{"KEY":"Your funds will be automatically invested at Stryke."},{"KEY":"Visit Merkl to claim Rewards."}]},"WITHDRAW":{"HEADING":"Withdraw","LIST":[{"KEY":"You can withdraw all or part of your funds. You can initiate a withdrawal anytime."}],"STRYKE":[{"KEY":"You can withdraw all or part of your funds anytime to exit the vault."},{"KEY":"All un-utilized liquidity at Stryke will be burnt and converted into base asset, then returned to user."},{"KEY":"All utilized liquidity at Stryke will be directly returned to user. User gets the control over the returned liquidity, and can manage on Stryke UI."}]},"FEE":{"HEADING":"Fee Structure","CONTENT":{"STRYKE":"The vault fee structure consists of a 0.1% deposit fee and a 0% performance fee."}}},"STRATEGY_FEATURES":{"TITLE":"Blackhole Strategy Features","DN_VAULT":{"1":{"TITLE":"Delta Hedge","DESC":"By hedging the delta of a liquidity pair, liquidity providers can balance market risk and avoid drastic losses when the asset price decreases."},"2":{"TITLE":"Auto Rebalancing","DESC":"Blackhole's rebalancing bot and Gelato's automated task perform range management automatically."},"3":{"TITLE":"Adaptive Range Setting","DESC":"This strategy determines the range by assessing volatility, aiming to achieve a consistent fee return. When volatility is low, it provides liquidity in a narrow range; conversely, when volatility is high, the range is widened."}},"STRYKE_AUTOMATOR":{"1":{"TITLE":"Auto Rebalancing +-2.5% Range","DESC":"The Arbitrum STIP Reward is distributed to liquidity that is within a range of ±2.5% of the current price. This vault is designed to automatically rebalance in order to stay within this range, which maximizes your potential rewards. For a detailed explanation of the liquidity management strategy, please visit the document through the button below."},"2":{"TITLE":"Auto-withdraw Liquidity","DESC":"Monitoring the utilization status for withdrawal LPers on Stryke are rarely able to withdraw their liquidity as their liquidity is often utilized. Blackhole addresses this issue by managing liquidity at the tick level and automatically, instantly withdrawing it as soon as it becomes available."},"3":{"TITLE":"Backtest Data","DESC":"This strategy is backtested with STIP rewards distributed on Merkl.\nVisit the link below for the detail."}}},"RISKS":{"TITLE":"Risks","FINANCIAL_RISKS":{"HEADING":"Financial Risks","LIST":[{"KEY":"Blackhole takes a short position with a lending protocol by paying interest."},{"KEY":"Impermanent loss(IL) and Loss vs Rebalance(LVR) are the major risks when providing a concentrated liquidity position to Uniswap V3."},{"KEY":"Blackhole could experience a loss if IL, LVR, or interest for the hedge is higher than the earned fees."},{"KEY":"The Hedge control strategy might not always capture the right market trend if there is a sudden change in the market trend and thus might result in the position’s IL."}]},"SMART_CONTRACT_RISKS":{"HEADING":"Smart Contract Risks","LIST":[{"KEY":"Blackhole takes security seriously. Our smart contracts have been audited by WatchPug. However, smart contracts still have risks, and we encourage users to only deposit funds you can afford to lose."},{"KEY":"Blackhole ETH-USDC.e interacts with multiple protocols and is exposed to other smart contracts' security standards."}]}},"ACTION":{"READ_MORE":"Read more","CLOSE":"Close"}}}}},"__N_SSG":true}